data/raw_bench/900_output.txt
Running 30s test @ http://10.99.59.146:8080/wrk2-api/home-timeline/read
  4 threads and 200 connections

  Thread calibration: mean lat.: 0.583ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.582ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.585ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.583ms, rate sampling interval: 10ms

-----------------------------------------------------------------------
Test Results @ http://10.99.59.146:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   576.18us  116.76us 847.00us   77.51%
    Req/Sec   236.08    155.92   666.00     71.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  565.00us
 75.000%  637.00us
 90.000%  706.00us
 99.000%  847.00us
 99.900%    1.27ms
 99.990%    4.00ms
 99.999%    4.96ms
100.000%    4.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.283     0.000000            1         1.00
       0.456     0.100000         1814         1.11
       0.488     0.200000         3623         1.25
       0.513     0.300000         5378         1.43
       0.539     0.400000         7162         1.67
       0.565     0.500000         8933         2.00
       0.578     0.550000         9841         2.22
       0.591     0.600000        10711         2.50
       0.605     0.650000        11629         2.86
       0.620     0.700000        12510         3.33
       0.637     0.750000        13391         4.00
       0.646     0.775000        13855         4.44
       0.655     0.800000        14290         5.00
       0.665     0.825000        14727         5.71
       0.676     0.850000        15176         6.67
       0.690     0.875000        15632         8.00
       0.698     0.887500        15858         8.89
       0.706     0.900000        16070        10.00
       0.716     0.912500        16308        11.43
       0.726     0.925000        16530        13.33
       0.738     0.937500        16743        16.00
       0.745     0.943750        16858        17.78
       0.752     0.950000        16966        20.00
       0.760     0.956250        17072        22.86
       0.771     0.962500        17193        26.67
       0.781     0.968750        17297        32.00
       0.788     0.971875        17353        35.56
       0.796     0.975000        17411        40.00
       0.802     0.978125        17462        45.71
       0.811     0.981250        17519        53.33
       0.821     0.984375        17575        64.00
       0.826     0.985938        17599        71.11
       0.832     0.987500        17630        80.00
       0.840     0.989062        17656        91.43
       0.854     0.990625        17685       106.67
       0.868     0.992188        17713       128.00
       0.876     0.992969        17727       142.22
       0.889     0.993750        17739       160.00
       0.914     0.994531        17753       182.86
       0.943     0.995313        17767       213.33
       0.991     0.996094        17781       256.00
       1.010     0.996484        17788       284.44
       1.044     0.996875        17795       320.00
       1.064     0.997266        17802       365.71
       1.116     0.997656        17809       426.67
       1.141     0.998047        17816       512.00
       1.147     0.998242        17819       568.89
       1.189     0.998437        17823       640.00
       1.212     0.998633        17826       731.43
       1.238     0.998828        17830       853.33
       1.271     0.999023        17833      1024.00
       1.302     0.999121        17835      1137.78
       1.334     0.999219        17837      1280.00
       1.347     0.999316        17838      1462.86
       1.359     0.999414        17840      1706.67
       1.399     0.999512        17842      2048.00
       1.433     0.999561        17843      2275.56
       1.589     0.999609        17844      2560.00
       1.589     0.999658        17844      2925.71
       2.049     0.999707        17845      3413.33
       2.251     0.999756        17846      4096.00
       2.253     0.999780        17847      4551.11
       2.253     0.999805        17847      5120.00
       2.253     0.999829        17847      5851.43
       3.999     0.999854        17848      6826.67
       3.999     0.999878        17848      8192.00
       4.343     0.999890        17849      9102.22
       4.343     0.999902        17849     10240.00
       4.343     0.999915        17849     11702.86
       4.343     0.999927        17849     13653.33
       4.343     0.999939        17849     16384.00
       4.963     0.999945        17850     18204.44
       4.963     1.000000        17850          inf
#[Mean    =        0.576, StdDeviation   =        0.117]
#[Max     =        4.960, Total count    =        17850]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  26611 requests in 30.01s, 5.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 32
Requests/sec:    886.78  
Transfer/sec:    172.33KB